name: "LeNet"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "/home/wen/DeepNDF/mnist/mnist_train_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "/home/wen/DeepNDF/mnist/mnist_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "ip"
  type: "InnerProduct"
  bottom: "pool2"
  top: "ip"
  param {
    lr_mult: 0
  }
  inner_product_param {
    num_output: 150
    bias_term: false
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "df"
  type: "DecisionForest"
  bottom: "ip"
  bottom: "label"
  top: "loss"
  top: "df"
  propagate_down: 0
  propagate_down: 0
  param {
    lr_mult: 1e-20
  }
  decision_forest_param {
    num_output: 10
    tree_num: 10
    depth: 5
    weight_filler {
      type: "constant"
      value: 0.1
    }
    mini_batch_num: 600
    change_weight: true
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "df"
  bottom: "label"
  top: "accuracy"
}
